tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"

# Languages
brew "node"
brew "nvm"
brew "pnpm"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "iterm2"
cask "zen"
cask "firefox"
cask "visual-studio-code"
cask "raycast"
cask "docker"
cask "ghostty"
cask "aerospace"
cask "caffeine"
cask "discord"
cask "kap"
cask "spotify"
cask "gitkraken"
cask "postman"
cask "claude"
cask "claude-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"